<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
	<title>Les meg - Addon File Editor</title>
	<link href="help_afe.css" rel="stylesheet" type="text/css" media="screen" />
</head>

<body>

<div class="header">
	<h1>Admin verkt&oslash;y: "Addon File Editor (AFE)"</h1>
	<p>

	Dette verkt&oslash;yet lar deg <em>se</em>, <em>redigere</em>, <em>slette</em>, <em>opprette</em>, <em>laste opp</em> eller 
	<em>sikkerhetskopiere</em> filer som tillh&oslash;rer Tillegg som for eksempel moduler, designmaler og spr&aring;kfiler fra Website Baker Admin sidene uten &aring; laste ned disse filene. Du kan ogs&aring; lage installasjonspakker av innstallerte Tillegg slik at disse kan installeres via Website Baker Admin sidene under Tillegg.
	</p>

	<dl>
		<dt>@forfatter:</dt>
		<dd>Christian Sommer (doc)</dd>

		<dt>@copyright:</dt>
		<dd>Christian Sommer &copy; 2008-2010</dd>

		<dt>@lisens:</dt>
		<dd><a href="http://www.gnu.org/licenses/gpl.html" target="_blank">GNU General Public license 3.0</a></dd>

		<dt>@versjon:</dt>
		<dd>1.1.2 (stabil)</dd>
		
		<dt>@language:</dt>
		<dd>Norsk Bokm&aring;l/Norwegian</dd>

		<dt>@translations:</dt>
		<dd>Odd Egil Hansen	(oeh)</dd>
		
		<dt>@plattform:</dt>
		<dd>Website Baker 2.8</dd>

		<dt>@krav:</dt>
		<dd><span style="color: red;">PHP 4.3.11 eller h&oslash;yere, WB 2.8 (alle funksjoner), WB 2.7 (begrensede funksjoner)</span></dd>
	</dl>
</div>

<p><b>Hurtig navigasjon:</b></p>
<ul>

	<li><a href="#sectiona">Seksjon A: Installasjon</a></li>
	<li><a href="#sectionb">Seksjon B: Krav og begrensninger</a></li>
	<li><a href="#sectionc">Seksjon C: Jobbe med File Editor</a></li>
	<li><a href="#sectiond">Seksjon D: Innstillinger og Konfigurasjon</a></li>
	<li><a href="#sectione">Seksjon E: Pixlr Bilde Redigering (FAQ)</a></li>
	<li><a href="#sectionf">Seksjon F: Feils&oslash;king</a></li>

</ul>


<h2 id="sectiona">A: Installasjon</h2>
<ol>
	<li>Last ned "addon_file_editor_xx.zip" og inslaller via Website Baker Admin sidene under: -&gt; Tillegg -&gt; Moduler</i></li>
	<li>Gå til verkt&oslash;yet via Website Baker Admin sidene under: -&gt; Administrasjonsverkt&oslash;y -&gt; Addon File Editor.</li>

</ol>

<h2 id="sectionb">B: Krav og begrensninger</h2>
<p>Addon File Editor krever <b>PHP 4.3.11</b> eller h&oslash;yere. 
Siden AFE v0.80, er Website Baker 2.8 (RC2 eller h&oslash;yere) p&aring;krevet for &aring; kunne benytte alle funksjoner, slik som jQuery Toggle eller "Syntax Highlighting". 
AFE v0.80 fungerer med  WB 2.7, men da med begrensede funksjoner. For &aring; sl&aring; p&aring; "syntax highlighting" i AFE 0.80 for WB 2.7, 
f&oslash;lg instruksjonene i sksjonen tilpasset modus. WB 2.7 brukere kan eventuelt fortsette &aring; benytte versjon AFE v0.71 (ikke lenger vedlikeholdt).</p>
<p>Addon File Editor støtter ikke WB 2.6.x eller lavere.</p>

<p><b>Kun tillegg som fyller kravene under kan redigeres med Addon File Editor:</b></p>
<ol>
	<li>tillegg m&aring; v&aelig;re oppf&oslash;rt i WB databsen under "addons" (installert via WB)</li>

	<li>tillegg m&aring; v&aelig;re lesbre for PHP</li>
	<li>det m&aring; v&aelig;re en index.php fil i tilleggets rotfolder</li>
	<li>for &aring; redigere tillegg som er merket med r&oslash;dt, m&aring; du f&oslash;rst aktivere FTP funksjonen (se seksjon D)</li>
</ol>

<hr>
<p><b style="color: red;">Tilpasset modus (WB 2.7 + AFE 0.80):</b><br />
Det er to ting som er p&aring;krevet, for &aring; aktivere "syntax highlighting" for Website Baker versjon 2.7 og AFE 0.80.</p>
<ol>

	<li>kopier /include/editarea folderen fra en WB 2.8 installasjonspakke til folderen /include i WB installasjonen din</li>
	<li>d&oslash;p om filen /modules/addon_file_editor/backend_legacy.js til backend.js</li>
</ol>
<p><b>OBS: </b><br />
Addon File Editor 0.71 var den siste versjonen som ble utvikklet for Website Baker platformen 2.7. For &aring; dra nytte av alle poensialene i dette administrasjonsverkt&oslash;yet,  kreves det at du benytter Website Baker 2.8 eller h&oslash;yere.</p>
<hr>

<h2 id="sectionc">C: Jobbe med Addon File Editor</h2>
<h3>Over sikt over Tillegg:</h3>

<p>Verkt&oslash;yet lager en liste over alle installerte Tillegg, når du strater dette via: -&gt; Administrasjonsverkt&oslash;y -&gt; Addon File Editor.</p>

<p>Tilleggene er grupper i f&oslash;lgende seksjoner: <em>Moduler</em>, <em>Designmaler</em> og <em>Spr&aring;kfiler</em>.
Hvis du har aktivert Javascript, vil seksjonene automatisk starte som et minimert filtre. Du kan maksimere/ minimere seksjonens filtre med et museklikk.
Tilstanden for filtreet i en seksjon, lagres ved &aring; sette en innformasjonskapsel p&aring; din maskin, og vil huskes s&aring; lenge denne innformajonskapselen er p&aring; maskinen din.</p>

<p>For &aring; &aring;pne folderen for et spesifikt Tillegg i <b>filbehandleren</b>, klikke på navnet på Tillegget. For å lagen en <b>sikkerhetskopi</b> av et installet Tillegg med alle tillh&oslash;rende filer og foldere, klikker du p&aring; nedlastningsikonet til h&oslash;yre i listen.</p>

<h3>Filbehandleren:</h3>
<p>Filbehandleren viser filene og folderene for et spesifikt Tillegg. Som standard, vises kun filer med endelse som kan gjenkjennes (tekst, bilder, arkiver). Du kan endre hvilke filendelser som gjenkjennes ved &aring; redigere <tt>config.inc.php</tt>. For &aring; vise alle filendelser, redigerer du parameteret <tt>$show_all_files</tt> i <tt>config.inc.php</tt>.</p>

<p>For &aring; redigere en tekstfil, eller se et bilde i et nytt nettleservindu, klikker du p&aring; filnavnet. For &aring; dra nytte av syntax highlighting, er det påkrevet med Website Baker 2.8 eller høyere og Javascript. For &aring; "omd&oslash;pe" eller "slette" filer, klikker du p&aring; ikonet for behandling som finnes til høyre i filbehandleren.</p>

<p>Du kan <em>lage nye filer/ foldere</em> eller <em>laste opp filer</em> via linkene som vises p&aring; toppen av filbehandleren. <em>Oppdater</em> funksjonen tvinger filbehandleren til &aring; laste inn alle filer og foldere p&aring; nytt. Benytt denne funksjonen hvis du har installert et nytt tillegg.</p>

<p>Hvis du har sl&aring;tt p&aring; st&oslash;tte for Pixlr (i config.inc.php filen), vises ogs&aring; et ikon for redigering av bilder. Klikk p&aring; dette ikonet for &aring; sende et bilde fra ditt nettsted til online bilderedigeringsverkt&oslash;yet Pixlr for redigering der. N&aring;r du lagrer endringer du har gjort i Pixlr, vil bildet bli lastet ned til nettstedet dit og omdøpt fra <tt>bilde_navn.jpg</tt> til <tt>bilde_navn.pixlr.jpg</tt>. Det orginale blir derfor ikke ber&oslash;rt av denne redigeringen (du kan slette dette hvis det ikke lenger er behov for dette). For &aring; benytte deg av Pixlr tjenesten m&aring; du ha installert en <b>Flash Plugin</b> i nettleseren din. For fler detaljer se Kapittel D.</p>

<h2 id="sectiond">D: Innstillinger og Konfigurasjon</h2>
<p>De fleste innstillinger kan endres via konigurajonsfilen <tt>config.inc.php</tt> som du finner i Addon File Editor folderen. Du kan f&oslash;ye til eller fjerne filtyper for tekst, bilde og arkiv filer. F&oslash;lgende filtyper gjenkjennes som standard filtyper:</p>

<ul>
<li><b>$text_extensions:</b> 'txt', 'htm', 'html', 'htt', 'tmpl', 'tpl', 'xml', 'css', 'js', 'php', 'php3', 'php4', 'php5'</li>
<li><b>$image_extensions:</b> 'bmp', 'gif', 'jpg', 'jpeg', 'png'</li>
<li><b>$archive_extensions:</b> 'zip', 'rar', 'tar', 'gz'</li>
</ul>

<p>Filtyper med andre endelser en det som er listet opp over er normalt satt til &aring; v&aelig;re skulte <tt>($show_all_files = false)</tt>. For &aring; skjule bestemte Tillegg, legger du til stien til folderen som Tillegget ligger i under tabellen <b>$hidden_addons = array()</b>. Hvis du legger til 'addon_file_editor" i denne tabellen, vil du ikke lenger ha mulighet for å endre config.inc.php filen i AFE.</p>

<p>Den maksimale st&oslash;rrelsen for opplasting er begrenset til 2 MB <b>($max_upload_size = 2)</b>, Pixlr st&oslash;tte er som standard sl&aring;tt av <b>($pixlr_support = false)</b>.</p>

<p>Verkt&oslash;yet har integrert en <b>valgfri FTP st&oslash;tte</b>, hvilket gir deg tilgang til Tillegg og filer som vaneligvis eies av ftp-user (slik som WB kjerne designmaler eller kjerne moduler som er lastet opp med FTP). Du kan konfigurere FTP st&oslash;tte med FTP assistenten via: 
<b>http://yourdomain.com/modules/addon_file_editor/ftp_assistant.php</b><br />
Filer som kun kan redigeres med FTP st&oslash;tte p&aring;sl&aring;tt er markert med r&oslash;dt.</p>

<h2 id="sectione">E: Pixlr Bilde Redigering (FAQ)</h2>
For &aring; kunne redigere bilder, er tredjeparts online fororedigeringsverkt&oslash;yet <a href="http://pixlr.com/" target="_blank">http://pixlr.com</a> benyttet. For &aring; kunne benytte Pixlr, m&aring; fl&oslash;lgende alle av de f&oslash;lgende gravene v&aelig;re oppfylt:</p>
<ol>

<li>Du m&aring; aktivere denne funksjonen manuelt ved &aring; endre f&oslash;lgende parameter til<tt>$pixlr_support = true;</tt> i(config.inc.php)</li>
<li>Det kreves at nettleseren din har installert <a href="http://get.adobe.com" target="_blank">Adobe Flash Player</a> Plugin</li>
<li>Bildet som skal redigeres m&aring; v&aelig;re tilgjengelig p&aring; webserveren (bilder p&aring; din egen maskin vil ikke kunne redigeres)</li>
<li>PHP m&aring; ha b&aring;de lese og skrivetilgang til bildet (det er forel&oslash;pig ikke st&oslash;tte for FTP)</li>
<li>Følgende bildeformater støttes: Lese (gif, jpg, png); Skrive: (jpg, png)</li>
</ol>

<p><b style="color: red;">OBS:</b><br />
Bildet du redigerer blir lastet opp til pixlr.com og slettes automatisk etter 5 minutter. Les ellers <a href="http://pixlr.com/faq/" target="_blank">Pixlr FAQ</a> f&oslash;r du benytter deg av denne tjenesten.</p>

<h2 id="sectionf">F: Feilretting</h2>
<p>N&aring;r du starter Addon File Editor, vil den gjeldende statusen for alle installerte Tillegg bli analysert og lagt i en hurtigbuffer. Dette gj&oslash;r at du kan benytte Addon File Editor uten &aring; m&aring;tte gnerer liste over Tilleggene p&aring; nytt. Dette har en ulempe. Hvid du installerer eller avistalerer et Tillegg i fra Admin sidene i Website Baker etter at File Editor ble startet, m&aring; du OPPDATERE listen over Tilleggene, slik at endringene på serveren blir synlige i listen. Dette kan gj&oslash;res ved &aring; klikke p&aring; [ Oppdater ] linken p&aring; toppen av oversiktslisten eller p&aring; toppen av Filbehandleren. Hvis du skulle st&oslash;te p&aring; problemer med &aring; oppdatere listene, pr&oslash;v &aring; t&oslash;mme, "cache" i nettleseren din, innformasjonskappslene (cookies) og de lagrede sesjonsvariablene (f.eks. ved &aring; logge ut), og s&aring; pr&oslash;ve p&aring; nytt.</p>

<p>Kos deg.<br />
Christian (Doc)

</p>

</body>
</html>